# BoundingBoxXYZ Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
BoundingBoxXYZ Constructor
BoundingBoxXYZ Class See Also
---
Constructs a new BoundingBoxXYZ with a default transform and extents of (-100, -100, -100) to (100, 100, 100).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public BoundingBoxXYZ()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
BoundingBoxXYZ()
```

# See Also
BoundingBoxXYZ Class
Autodesk.Revit.DB Namespace